from django import forms
from .models import Order

class OrderCreateForm(forms.ModelForm):
	PROVINCE_CHOICES = (
		('นครราชสีมา', 'นครราชสีมา'),
		('เชียงใหม่', 'เชียงใหม่'),
		('กาญจนบุรี', 'กาญจนบุรี '),
		('ตาก', 'ตาก '),
		('อุบลราชธานี', 'อุบลราชธานี '),
		('สุราษฎร์ธานี', 'สุราษฎร์ธานี '),
		('ชัยภูมิ', 'ชัยภูมิ '),
		('แม่ฮ่องสอน', 'แม่ฮ่องสอน '),
		('เพชรบูรณ์', 'เพชรบูรณ์ '),
		('ลำปาง', 'ลำปาง '),
		('อุดรธานี', 'อุดรธานี '),
		('เชียงราย', 'เชียงราย '),
		('น่าน', 'น่าน '),
		('เลย', 'เลย '),
		('ขอนแก่น', 'ขอนแก่น '),
		('พิษณุโลก', 'พิษณุโลก '),
		('บุรีรัมย์', 'บุรีรัมย์ '),
		('นครศรีธรรมราช', 'นครศรีธรรมราช '),
		('สกลนคร', 'สกลนคร '),
		('นครสวรรค์', 'นครสวรรค์ '),
		('ศรีสะเกษ', 'ศรีสะเกษ '),
		('กำแพงเพชร', 'กำแพงเพชร '),
		('ร้อยเอ็ด', 'ร้อยเอ็ด '),
		('สุรินทร์', 'สุรินทร์ '),
		('อุตรดิตถ์', 'อุตรดิตถ์ '),
		('สงขลา', 'สงขลา '),
		('สระแก้ว', 'สระแก้ว '),
		('กาฬสินธุ์', 'กาฬสินธุ์ '),
		('อุทัยธานี', 'อุทัยธานี '),
		('สุโขทัย', 'สุโขทัย '),
		('แพร่', 'แพร่ '),
		('ประจวบคีรีขันธ์', 'ประจวบคีรีขันธ์ '),
		('จันทบุรี', 'จันทบุรี '),
		('พะเยา', 'พะเยา '),
		('เพชรบุรี', 'เพชรบุรี '),
		('ลพบุรี', 'ลพบุรี '),
		('ชุมพร', 'ชุมพร '),
		('ฉะเชิงเทรา', 'ฉะเชิงเทรา '),
		('มหาสารคาม', 'มหาสารคาม '),
		('ราชบุรี', 'ราชบุรี '),
		('ตรัง', 'ตรัง '),
		('ปราจีนบุรี', 'ปราจีนบุรี '),
		('กระบี่', 'กระบี่ '),
		('พิจิตร', 'พิจิตร '),
		('ยะลา', 'ยะลา '),
		('ลำพูน', 'ลำพูน '),
		('นราธิวาส', 'นราธิวาส '),
		('ชลบุรี', 'ชลบุรี '),
		('มุกดาหาร', 'มุกดาหาร '),
		('บึงกาฬ', 'บึงกาฬ '),
		('พังงา', 'พังงา '),
		('ยโสธร', 'ยโสธร '),
		('หนองบัวลำภู', 'หนองบัวลำภู '),
		('สระบุรี', 'สระบุรี '),
		('ระยอง', 'ระยอง '),
		('พัทลุง', 'พัทลุง '),
		('ระนอง', 'ระนอง '),
		('อำนาจเจริญ', 'อำนาจเจริญ '),
		('หนองคาย', 'หนองคาย '),
		('ตราด', 'ตราด '),
		('พระนครศรีอยุธยา', 'พระนครศรีอยุธยา '),
		('สตูล', 'สตูล '),
		('ชัยนาท', 'ชัยนาท '),
		('นครปฐม', 'นครปฐม '),
		('นครนายก', 'นครนายก '),
		('ปัตตานี', 'ปัตตานี '),
		('กรุงเทพมหานคร', 'กรุงเทพมหานคร '),
		('ปทุมธานี', 'ปทุมธานี '),
		('สมุทรปราการ', 'สมุทรปราการ '),
		('อ่างทอง', 'อ่างทอง '),
		('สมุทรสาคร', 'สมุทรสาคร '),
		('สิงห์บุรี', 'สิงห์บุรี '),
		('นนทบุรี', 'นนทบุรี '),
		('ภูเก็ต', 'ภูเก็ต '),
		('สมุทรสงคราม', 'สมุทรสงคราม '),
		('นครพนม', 'นครพนม ')
	)

	DISCRICT_CHOICES = (
		('Dhaka', 'Dhaka'), 
		('Gazipur', 'Gazipur'),
		('Narayanganj', 'Narayanganj'),
	)

	PAYMENT_METHOD_CHOICES = (
		('VISA', 'VISA'),
		('Master Card','Master Card'),
		('Prompt pay', 'Prompt pay'),
		('True Wallet', 'True Wallet'),
		('ชำระด้วยไต', 'ชำระด้วยไต')

	)

	province = forms.ChoiceField(choices=PROVINCE_CHOICES)
	district =  forms.CharField()
	payment_method = forms.ChoiceField(choices=PAYMENT_METHOD_CHOICES, widget=forms.RadioSelect())

	class Meta:
		model = Order
		fields = ['name', 'email', 'phone', 'address', 'province', 'district', 'zip_code', 'payment_method', 'account_no', 'transaction_id']
